Revit 2027 API
SpatialElementTag.TagText Property
 The text displayed by the tag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string TagText { get; }
Public ReadOnly Property TagText As String
	Get
public:
property String^ TagText {
	String^ get ();
}
member TagText : string with get
Property Value
String
Remarks
 If there are several strings included in the tag, the strings will be returned concatenated.
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace